In [1]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_30824/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [3]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [4]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

SQL ALTER TABLE Statement
- The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.
- The ALTER TABLE statement is also used to add and drop various constraints on an existing table.

ALTER TABLE - ADD Column
- To add a column in a table, use the following syntax:

>ALTER TABLE table_name
>
>ADD column_name datatype;

In [7]:
#cur.execute('''DROP TABLE testDB.CustomersNew;''')

In [6]:
cur.execute('''CREATE TABLE testDB.CustomersNew AS SELECT * FROM testDB.Customers;''')

91

In [6]:
# The following SQL adds an "Email" column to the "Customers" table:
cur.execute('''ALTER TABLE testDB.CustomersNew
ADD Email varchar(255);''')

0

In [7]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.CustomersNew;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country,Email
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany,None
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico,None
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico,None
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK,None
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden,None
...,...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland,None
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil,None
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA,None
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland,None
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland,None

ALTER TABLE - DROP COLUMN
- To delete a column in a table, use the following syntax (notice that some database systems don't allow deleting a column):

>ALTER TABLE table_name
>
>DROP COLUMN column_name;

In [8]:
# The following SQL deletes the "Email" column from the "Customers" table:
cur.execute('''ALTER TABLE testDB.CustomersNew
DROP COLUMN Email;''')

0

In [15]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.CustomersNew;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

ALTER TABLE - RENAME COLUMN
- To rename a column in a table, use the following syntax:

>ALTER TABLE table_name
>
>RENAME COLUMN old_name to new_name;

- To rename a column in a table in SQL Server, use the following syntax:

>SQL Server:
>
>EXEC sp_rename 'table_name.old_name',  'new_name', 'COLUMN';

In [27]:
# Example MySQL:
cur.execute('''ALTER TABLE testDB.CustomersNew
CHANGE COLUMN Country Country2 varchar(255);''')

0

In [28]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.CustomersNew;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country2
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constitución 2222,México D.F.,05021,Mexico
2,3,Antonio Moreno Taquería,Antonio Moreno,Mataderos 2312,México D.F.,05023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbköp,Christina Berglund,Berguvsvägen 8,Luleå,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

ALTER TABLE - ALTER/MODIFY DATATYPE
- To change the data type of a column in a table, use the following syntax:

>SQL Server / MS Access:
>
>ALTER TABLE table_name
>
>ALTER COLUMN column_name datatype;

>My SQL / Oracle (prior version 10G):
>
>ALTER TABLE table_name
>
>MODIFY COLUMN column_name datatype;

>Oracle 10G and later:
>
>ALTER TABLE table_name
>
>MODIFY column_name datatype;

SQL ALTER TABLE Example
- Look at the "Persons" table:

In [24]:
# We use the following SQL statement:
cur.execute('''ALTER TABLE testDB.Persons
DROP COLUMN DateOfBirth;''')

0

In [25]:
# Return data from the ShippersOld table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   PersonID   LastName FirstName       Address       City
0         1     Hansen       Ola  Timoteivn 10    Sandnes
1         2   Svendson      Tove     Borgvn 23    Sandnes
2         3  Pettersen      Kari     Storgt 20  Stavanger

Now we want to add a column named "DateOfBirth" in the "Persons" table.

In [26]:
# We use the following SQL statement:
cur.execute('''ALTER TABLE testDB.Persons
ADD DateOfBirth date;''')

0

Notice that the new column, "DateOfBirth", is of type date and is going to hold a date. The data type specifies what type of data the column can hold. For a complete reference of all the data types available in MS Access, MySQL, and SQL Server, go to our complete Data Types reference.

In [28]:
cur.execute('''UPDATE testDB.Persons
SET DateOfBirth = 1974;''')
conn.commit()

OperationalError: (1292, "Incorrect date value: '1974' for column 'DateOfBirth' at row 1")

In [29]:
# The "Persons" table will now look like this:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   PersonID   LastName FirstName       Address       City DateOfBirth
0         1     Hansen       Ola  Timoteivn 10    Sandnes        None
1         2   Svendson      Tove     Borgvn 23    Sandnes        None
2         3  Pettersen      Kari     Storgt 20  Stavanger        None

Change Data Type Example
- Now we want to change the data type of the column named "DateOfBirth" in the "Persons" table.

In [30]:
# We use the following SQL statement:
cur.execute('''ALTER TABLE testDB.Persons
CHANGE COLUMN DateOfBirth DateOfBirth year(4);''')

3

In [31]:
cur.execute('''UPDATE testDB.Persons
SET DateOfBirth = 1974;''')
conn.commit()

In [32]:
# The "Persons" table will now look like this:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   PersonID   LastName FirstName       Address       City  DateOfBirth
0         1     Hansen       Ola  Timoteivn 10    Sandnes         1974
1         2   Svendson      Tove     Borgvn 23    Sandnes         1974
2         3  Pettersen      Kari     Storgt 20  Stavanger         1974

Notice that the "DateOfBirth" column is now of type year and is going to hold a year in a two- or four-digit format.

DROP COLUMN Example
- Next, we want to delete the column named "DateOfBirth" in the "Persons" table.

In [35]:
# We use the following SQL statement:
cur.execute('''ALTER TABLE testDB.Persons
DROP COLUMN DateOfBirth;''')

0

In [36]:
# The "Persons" table will now look like this:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   PersonID   LastName FirstName       Address       City
0         1     Hansen       Ola  Timoteivn 10    Sandnes
1         2   Svendson      Tove     Borgvn 23    Sandnes
2         3  Pettersen      Kari     Storgt 20  Stavanger